/* Media type (string) */
"%[type]@ %[is, is not]@ %[Book, iTunesBook, iTunesAudiobook, Movie, iTunesMovie, iTunesShow, Music, iTunesAlbum, Software, VideoGame, Toy, Gadget, Tool]@" = "%1$[Type]@ %2$[is, is not]@ %3$[Book, iBook, iTunes Audiobook, Movie, iTunes Movie, iTunes Show, Music, iTunes Album, Software, Video Game, Toy, Gadget, Tool]@";


/* Single-line string properties */
"%[title, subtitle, notes, countryCode, serialNumber, key, loan.borrower.fullName, associatedURL, deweyDecimal, libraryOfCongressCallNumber, ean, isbn, asin, primaryDescriptionString, userSynopsis.string]@ %[is, is not, contains, begins with, ends with, matches]@ %@" = "%1$[Title, Subtitle, Notes, Country, Serial Number, Key, Borrower, URL, Dewey Decimal #, Library of Congress Call #, EAN, ISBN, Amazon Link, Primary Synopsis, Your Synopsis]@ %2$[is, is not, contains, begins with, ends with, matches]@ %3$@";

/* Single-line strings that are autocompleting, from CoreData */
"%[seriesSingularString, formatSingularString, conditionSingularString, audienceRecommendedAgeSingularString, locationSingularString, ownerSingularString]@ %[is, is not, contains, begins with, ends with, matches]@ %@" = "%1$[Series, Format, Condition, Audience, Location, Owner]@ %2$[is, is not, contains, begins with, ends with, matches]@ %3$@";

/* Multi-line string relationships (arrays) that are autocompleting, derived from CoreData */
"%[creatorsCompositeString.componentsSeparatedByLinefeed, genresCompositeString.componentsSeparatedByLinefeed, publishersCompositeString.componentsSeparatedByLinefeed, editionsCompositeString.componentsSeparatedByLinefeed, languagesCompositeString.componentsSeparatedByLinefeed, illustratorsCompositeString.componentsSeparatedByLinefeed, actorsCompositeString.componentsSeparatedByLinefeed, screenwritersCompositeString.componentsSeparatedByLinefeed, cinematographersCompositeString.componentsSeparatedByLinefeed, featuresCompositeString.componentsSeparatedByLinefeed, composersCompositeString.componentsSeparatedByLinefeed, conductorsCompositeString.componentsSeparatedByLinefeed, tracksCompositeString.componentsSeparatedByLinefeed, platformsCompositeString.componentsSeparatedByLinefeed]@ %[is, contains, begins with, ends with, matches]@ %@" = "Any %1$[Creator, Genre, Publisher, Edition, Language, Illustrator, Actor, Screenwriter, Cinematographer, Feature, Composer, Conductor, Track, Platform]@ %2$[is, contains, begins with, ends with, matches]@ %3$@";
"%[creatorsCompositeString.componentsSeparatedByLinefeed, genresCompositeString.componentsSeparatedByLinefeed, publishersCompositeString.componentsSeparatedByLinefeed, editionsCompositeString.componentsSeparatedByLinefeed, languagesCompositeString.componentsSeparatedByLinefeed, illustratorsCompositeString.componentsSeparatedByLinefeed, actorsCompositeString.componentsSeparatedByLinefeed, screenwritersCompositeString.componentsSeparatedByLinefeed, cinematographersCompositeString.componentsSeparatedByLinefeed, featuresCompositeString.componentsSeparatedByLinefeed, composersCompositeString.componentsSeparatedByLinefeed, conductorsCompositeString.componentsSeparatedByLinefeed, tracksCompositeString.componentsSeparatedByLinefeed, platformsCompositeString.componentsSeparatedByLinefeed]@ %[is not]@ %@" = "Every %1$[Creator, Genre, Publisher, Edition, Language, Illustrator, Actor, Screenwriter, Cinematographer, Feature, Composer, Conductor, Track, Platform]@ %2$[is not]@ %3$@";

/* Color matching (Multi-line string relationships (arrays) that are autocompleting, derived from CoreData) */
"%[coverImageColorsCompositeString.componentsSeparatedByLinefeed]@ %[is, is not]@ %@" = "%1$[Cover Image]@ %2$[contains a lot of, does not contain a lot of]@ %3$@";

/* Float, integer, date properties */
"%[numberInSeries, publishDate, numberOfMedia, purchaseDate, pages, theatricalDate, minutes, minimumPlayers, maximumPlayers, loan.dueDate, loan.daysOverdue, boxHeightInInches, boxLengthInInches, boxWeightInPounds, boxWidthInInches, creationDate]@ %[is, is not, is less than, is greater than, is less than or equal to, is greater than or equal to]@ %@" = "%1$[No. in Series, Release Date, No. of Items, Purchase Date, Pages, Theatrical Debut, Minutes Long, Minimum Players, Maximum Players, Due Date, Days Overdue, Height (inches), Length (inches), Weight (Pounds), Width (inches), Creation Date]@ %2$[is, is not, is less than, is greater than, is less than or equal to, is greater than or equal to]@ %3$@";

/* Price (float) properties */
"%[price.valueInLocalCurrency, currentValue.valueInLocalCurrency, buyPrice.valueInLocalCurrency]@ %[is, is not, is less than, is greater than, is less than or equal to, is greater than or equal to]@ %@" = "%1$[Retail Price, Current Value, Purchase Price]@ %2$[is, is not, is less than, is greater than, is less than or equal to, is greater than or equal to]@ $%3$@";

/* Rating (int) properties */
"%[rating, netRating]@ %[is, is not, is less than, is greater than, is less than or equal to, is greater than or equal to]@ %[0, 0.5, 1, 1.5, 2, 2.5, 3, 3.5, 4, 4.5, 5]@" = "%1$[Rating, Net Rating]@ %2$[is, is not, is less than, is greater than, is less than or equal to, is greater than or equal to]@ %3$[Unrated, ½, ★, ★½, ★★, ★★½, ★★★, ★★★½, ★★★★, ★★★★½, ★★★★★]@";

/* Boolean properties */
"%[hasExperienced, used, isSigned, privateCollection, rare]@ %[is]@ %[0, 1]@" = "%1$[Played / Read, Used, Signed, Private, Rare]@ %2$[is]@ %3$[No, Yes]@";
